{
  "main": {
    "name": "James",
    "occupation": "Software Engineer",
    "description": "Highly motivated, passionate, and dynamic with diverse experience building and launching high-end Mobile and Web applications. ",
    "image": "profilepic.png",
    "bio": "Hey there! Welcome to my website. I love to live a very balanced lifestyle, so when i'm not coding , i'm most probably playing video games or i'm out with my friends. I listen to a lot of music, and i see movies occassionally. I genuinely love to get drinks with friends and occassionaly party yeah right!.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me",
    "email": "jordunjames@gmail.com",
    "phone": "+2347066047054",
    "address": {
      "street": "5 daisy close,Peninsula Garden Estate",
      "city": "Ajah",
      "state": "Lagos",
      "zip": "101245"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/ikwechegh",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com/ikwechegh",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ikwechegh/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/jay_1o2",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/jay102",
        "className": "fa fa-github"
      },
      {
        "name": "skype",
        "url": "http://skype.com/ikwechegh",
        "className": "fa fa-skype"
      }
    ]
  },
  "resume": {
    "skillmessage": "Proficient in Mobile development, Front and Back-end Web Development. ",
    "education": [
      {
        "school": "Gregory University",
        "degree": "Bachelors in Computer Science",
        "graduated": "October 2018",
        "description": "Fresh out of High school i was confident i wanted a career in IT, studying computer science introduced me to the core principles and underlying theories involved in computer programming. I got to learn about algorithms, operating systems, data structures, flowcharts, pseudocodes etc. My favorite course was on object oriented programming, where i got to learn about Java(*which is my favorite language*), inheritance, polymorphism and other OOP concepts. Computer science gave me the needed foundation required to be a full-fledged software Engineer"
      }
    ],
    "work": [
      {
        "company": "Boku Connect Limited",
        "title": "Software Engineer ",
        "years": "January 2019 - Present",
        "description": "I am Responsible for server-side web application logic as well as the integration of the front-end. Test user-defined functions, triggers, and API endpoints. I work closely with software development and testing team members to design and develop robust Full-stack solutions to meet client requirements for functionality, scalability, and performance.I also research, design and implement scalable applications for the Android platform "
      },
      {
        "company": "Greenmouse Technologies",
        "title": "Mobile Application Developer",
        "years": "October 2018 - December 2018",
        "description": " While working here, i Created custom mobile applications using native technologies as per client specifications. Part of the job that comes with development is documentation, so i Devised all documentation for each app, detailing all aspects, functions, capabilities, and features. I Worked with other developers, UI designers, and product management to deliver user-friendly appealing mobile Applications for the Android platform. I also Ensure applications are properly integrated with Android APIs. Participated in fast-paced development cycles. completed 100% of deadlines ahead of schedule"
      },
      {
        "company": "Greenmouse Technologies",
        "title": "Web Developer Intern",
        "years": "April 2017 - November 2017",
        "description": "I did my internship with the company, and i was involved in the Design and development of Mobile responsive Websites using WordPress. Responsible for the redesign of the current company website greenmousetech.com at the time. Extensive use of photoediting softwares for design of banners, logos etc. I also worked with UI/UX designers on different websites Mockups"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Java",
        "level": "90%"
      },
      {
        "name": "Android",
        "level": "90%"
      },
      {
        "name": "JavaScript",
        "level": "70%"
      },
      {
        "name": "NodeJs",
        "level": "80%"
      },
      {
        "name": "Express Js",
        "level": "80%"
      },
      {
        "name": "ReactJs",
        "level": "60%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "MyTripza",
        "category": "(Native Android)A car hailing Android App where car owners get to share rides",
        "image": "myTripza.png",
        "url": "#"
      },
      {
        "title": "Crypto Currency Converter",
        "category": "(Native Android)A real-time crypto currency converter that converts BTC AND ETH to the current rate in 20 different currencies",
        "image": "cryptoconverter.png",
        "url": "https://github.com/jay102/CryptoExchange"
      },
      {
        "title": "myPurse",
        "category": "My purse helps manage income, calculates user expenditure and income. User gets to set monthly expendable amount",
        "image": "myPurse.png",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "mywebsite.PNG",
        "url": "http://www.jaycodes.com"
      },
      {
        "title": "JonMac Smile Foundation",
        "category": "A website for an NGO saddled with the responsibility of caring, helping and bringing smiles on the faces of the less privileged.",
        "image": "ngo.PNG",
        "url": "https://jonmacsmilefoundation.org"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "That James must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Ugonna okoli"
      }
    ]
  }
}